package Homework.HW_7_1;
/**Задача №2
 Необходимо создать класс Worker где метод getSalary будет возвращать базовую ставку.
*/
 public class Worker {
 public static void main(String[] args) {
  Employee e1 = new Employee();
  System.out.println(e1.getSalary());
 }
}
